Catalogs/ПричиныОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПричиныОбращений</Name>
			<Comment>Причины обращений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Comment>Полное описание причины обращения клиента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код причины обращения по классификатору</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПричиныОбращения</Name>
					<Comment>Тип причины обращения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПричинОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта причины обращения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВыбор</Name>
					<Comment>Запретить выбор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторабот</Name>
					<Comment>Тип авторабот</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения по причине обращения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПричиныОбращений/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Инициализация дерева причин обращений.
//
// Параметры:
//  ДеревоПричинОбращений	 - ДеревоЗначений, Неопределено - Дерево заполнения.
// 
// Возвращаемое значение:
//  ДеревоЗначений - Пустое дерево причин обращений.
//
Функция ИнициализироватьДеревоПричинОбращений(ДеревоПричинОбращений = Неопределено) Экспорт
	
	ДеревоПричинОбращений = Новый ДеревоЗначений;
	ДеревоПричинОбращений.Колонки.Добавить("ИдентификаторПричиныОбращения");
	ДеревоПричинОбращений.Колонки.Добавить("ПричинаОбращения");
	ДеревоПричинОбращений.Колонки.Добавить("ПричинаОбращенияСодержание");
	ДеревоПричинОбращений.Колонки.Добавить("ТипПричиныОбращения");
	
	Возврат ДеревоПричинОбращений;
	
КонецФункции

#Область ЗаполнениеДанных

// Формирует коллекцию с причинами обращения из документа основания
//
// Параметры:
//  ПричиныОбращенияОснования - ТаблицаЗначений - перечень причин из основания
// 
// Возвращаемое значение:
//  ДеревоЗначений
//
Функция ПолучитьДеревоПричинОбращенийИзОснования(Знач ПричиныОбращенияОснования) Экспорт
	
	ДеревоПричинОбращений = Неопределено;
	ИнициализироватьДеревоПричинОбращений(ДеревоПричинОбращений);
	
	КопируемыеСтроки = Новый Массив();
	ЗапрещенныеПричины = Справочники.ПричиныОбращений.ПолучитьЗапрещенныеКВыборуПричины();
	
	Для Каждого ПроверяемаяСтрока Из ПричиныОбращенияОснования Цикл
		
		Если ЗапрещенныеПричины.Найти(ПроверяемаяСтрока.ПричинаОбращения) = Неопределено Тогда
			
			КопируемыеСтроки.Добавить(ПроверяемаяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПричиныОбращенияОснованияКопия = ПричиныОбращенияОснования.Выгрузить(КопируемыеСтроки);
	ПричиныОбращенияКПереносу = ПричиныОбращенияОснования.Выгрузить(КопируемыеСтроки, "ТипПричиныОбращения");
	ПричиныОбращенияКПереносу.Свернуть("ТипПричиныОбращения");
	
	Для Каждого СтрокаЗаказНаряда Из ПричиныОбращенияКПереносу Цикл
		
		НовыйЗаказНаряд = ДеревоПричинОбращений.Строки.Добавить();
		ОтборСтрок = Новый Структура("ТипПричиныОбращения", СтрокаЗаказНаряда.ТипПричиныОбращения);
		МассивПричинОбращения = ПричиныОбращенияОснованияКопия.НайтиСтроки(ОтборСтрок);
		
		Для Каждого СтрокаПричиныОбращения Из МассивПричинОбращения Цикл
			
			НоваяПричинаОбращения = НовыйЗаказНаряд.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПричинаОбращения, СтрокаПричиныОбращения);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДеревоПричинОбращений;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеВнешнимВидом

Процедура УстановитьОтборНаВыбираемыеЭлементы(Список, ИмяПоля = "Ссылка") Экспорт
	
	ЗначениеОтбора = Новый СписокЗначений;
	ЗначениеОтбора.ЗагрузитьЗначения(Справочники.ПричиныОбращений.ПолучитьЗапрещенныеКВыборуПричины());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			ИмяПоля,
																			ЗначениеОтбора,
																			ВидСравненияКомпоновкиДанных.НеВСписке,,
																			Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
